xml/request/creator.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope"
 xmlns:xml="http://www.w3.org/XML/1998/namespace"
 xmlns:tns="http://oss.dbc.dk/ns/openscan_wsdl"
 xmlns:scan="http://oss.dbc.dk/ns/openscan"
 xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
 xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
 xmlns:xs="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<scan:scanRequest>
  <scan:field>phrase.creator</scan:field>
  <scan:limit>10</scan:limit>
  <scan:lower>Haruki</scan:lower>
  <scan:outputType>xml</scan:outputType>
</scan:scanRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

