xml/request/agency_and_query.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope"
xmlns:xml="http://www.w3.org/XML/1998/namespace"
xmlns:tns="http://oss.dbc.dk/ns/openscan_wsdl"
xmlns:types="http://oss.dbc.dk/ns/openscan"
xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
xmlns:xs="http://www.w3.org/2001/XMLSchema"
xmlns:scan="http://oss.dbc.dk/ns/openscan">
<SOAP-ENV:Body>
<types:scanRequest>
  <scan:agency>710100</scan:agency>  
  <scan:field>phrase.anyIndexes</scan:field>
  <scan:limit>10</scan:limit>
  <scan:lower>øv for pok</scan:lower>  
  <scan:query>dc.language=dansk</scan:query> 
  <scan:timeToWait>750</scan:timeToWait>  
  <scan:outputType>xml</scan:outputType>
</types:scanRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
